of_seminar_Sloshing/Solution/sloshingTank_G/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      binary;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

3
(
    side
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          3320;
        startFace       113240;
    }
    top
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          300;
        startFace       116560;
    }
    bottom
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          300;
        startFace       116860;
    }
)

// ************************************************************************* //
